In [20]:
%pylab inline
import pandas
import seaborn

Populating the interactive namespace from numpy and matplotlib

In [4]:
df = pandas.read_csv('/Users/alexyuan/Desktop/Language/Python_project/MOCK_DATA.csv')

In [5]:
df.head(n=5)

   id first_name  last_name  gender           state car_make  car_model_year
0   1      Hersh    Blincow    Male        Colorado  Mercury            1985
1   2     Yorgos     Busher    Male        New York      Kia            2001
2   3   Harriett    Richten  Female     Connecticut    Volvo            2003
3   4      Bryan  Wardingly    Male      California    Dodge            1995
4   5    Cristin   Thulborn  Female  North Carolina   Suzuki            2009

In [6]:
df.tail(n=5)

       id first_name   last_name  gender       state  car_make  car_model_year
995   996     Boigie      Yellop    Male       Texas       GMC            2002
996   997     Gracie  Comberbach  Female     Indiana  Infiniti            2009
997   998    Bertina     Ledgley  Female  California     Mazda            1990
998   999       Kiel       Cheal    Male     Florida     Honda            2006
999  1000     Jordan   Dallender  Female     Florida  Cadillac            2001

In [7]:
df.index

RangeIndex(start=0, stop=1000, step=1)

In [8]:
df.columns

Index(['id', 'first_name', 'last_name', 'gender', 'state', 'car_make',
       'car_model_year'],
      dtype='object')

In [9]:
df.describe()

                id  car_model_year
count  1000.000000     1000.000000
mean    500.500000     2000.029000
std     288.819436        9.290451
min       1.000000     1954.000000
25%     250.750000     1995.000000
50%     500.500000     2001.500000
75%     750.250000     2007.000000
max    1000.000000     2013.000000

In [10]:
df.last_name.head()

0      Blincow
1       Busher
2      Richten
3    Wardingly
4     Thulborn
Name: last_name, dtype: object

In [11]:
df[1:4]

   id first_name  last_name  gender        state car_make  car_model_year
1   2     Yorgos     Busher    Male     New York      Kia            2001
2   3   Harriett    Richten  Female  Connecticut    Volvo            2003
3   4      Bryan  Wardingly    Male   California    Dodge            1995

In [12]:
df.loc[:,['last_name','state']]

      last_name           state
0       Blincow        Colorado
1        Busher        New York
2       Richten     Connecticut
3     Wardingly      California
4      Thulborn  North Carolina
..          ...             ...
995      Yellop           Texas
996  Comberbach         Indiana
997     Ledgley      California
998       Cheal         Florida
999   Dallender         Florida

[1000 rows x 2 columns]

In [13]:
df.loc[1:4,['last_name','state']]

   last_name           state
1     Busher        New York
2    Richten     Connecticut
3  Wardingly      California
4   Thulborn  North Carolina

In [14]:
df.at[1,'state']

'New York'

In [18]:
df[df.last_name == 'Busher']

   id first_name last_name gender     state car_make  car_model_year
1   2     Yorgos    Busher   Male  New York      Kia            2001

In [19]:
df[df['last_name'].isin(['Busher','Richten'])]

   id first_name last_name  gender        state car_make  car_model_year
1   2     Yorgos    Busher    Male     New York      Kia            2001
2   3   Harriett   Richten  Female  Connecticut    Volvo            2003

In [24]:
df.isna().sum()

id                0
first_name        0
last_name         0
gender            0
state             0
car_make          0
car_model_year    0
dtype: int64